qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L1/TARGET_NUCLEO_L152RE/stm32l152xe.h
/********************  Bit definition for RI_HYSCR3 register  ********************/
#define  RI_HYSCR3_PE                   ((uint32_t)0x0000FFFF) /*!< PE[15:0] Port E Hysteresis selection */
#define  RI_HYSCR3_PE_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_HYSCR3_PE_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_HYSCR3_PE_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_HYSCR3_PE_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_HYSCR3_PE_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_HYSCR3_PE_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_HYSCR3_PE_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_HYSCR3_PE_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_HYSCR3_PE_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_HYSCR3_PE_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_HYSCR3_PE_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_HYSCR3_PE_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_HYSCR3_PE_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_HYSCR3_PE_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_HYSCR3_PE_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_HYSCR3_PE_15                ((uint32_t)0x00008000) /*!< Bit 15 */
#define  RI_HYSCR3_PF                   ((uint32_t)0xFFFF0000) /*!< PF[15:0] Port F Hysteresis selection */
#define  RI_HYSCR3_PF_0                 ((uint32_t)0x00010000) /*!< Bit 0 */
#define  RI_HYSCR3_PF_1                 ((uint32_t)0x00020000) /*!< Bit 1 */
#define  RI_HYSCR3_PF_2                 ((uint32_t)0x00040000) /*!< Bit 2 */
#define  RI_HYSCR3_PF_3                 ((uint32_t)0x00080000) /*!< Bit 3 */
#define  RI_HYSCR3_PF_4                 ((uint32_t)0x00100000) /*!< Bit 4 */
#define  RI_HYSCR3_PF_5                 ((uint32_t)0x00200000) /*!< Bit 5 */
#define  RI_HYSCR3_PF_6                 ((uint32_t)0x00400000) /*!< Bit 6 */
#define  RI_HYSCR3_PF_7                 ((uint32_t)0x00800000) /*!< Bit 7 */
#define  RI_HYSCR3_PF_8                 ((uint32_t)0x01000000) /*!< Bit 8 */
#define  RI_HYSCR3_PF_9                 ((uint32_t)0x02000000) /*!< Bit 9 */
#define  RI_HYSCR3_PF_10                ((uint32_t)0x04000000) /*!< Bit 10 */
#define  RI_HYSCR3_PF_11                ((uint32_t)0x08000000) /*!< Bit 11 */
#define  RI_HYSCR3_PF_12                ((uint32_t)0x10000000) /*!< Bit 12 */
#define  RI_HYSCR3_PF_13                ((uint32_t)0x20000000) /*!< Bit 13 */
#define  RI_HYSCR3_PF_14                ((uint32_t)0x40000000) /*!< Bit 14 */
#define  RI_HYSCR3_PF_15                ((uint32_t)0x80000000) /*!< Bit 15 */

/********************  Bit definition for RI_HYSCR4 register  ********************/
#define  RI_HYSCR4_PG                   ((uint32_t)0x0000FFFF) /*!< PG[15:0] Port G Hysteresis selection */
#define  RI_HYSCR4_PG_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_HYSCR4_PG_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_HYSCR4_PG_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_HYSCR4_PG_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_HYSCR4_PG_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_HYSCR4_PG_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_HYSCR4_PG_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_HYSCR4_PG_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_HYSCR4_PG_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_HYSCR4_PG_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_HYSCR4_PG_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_HYSCR4_PG_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_HYSCR4_PG_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_HYSCR4_PG_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_HYSCR4_PG_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_HYSCR4_PG_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_ASMR1 register  ********************/
#define  RI_ASMR1_PA                   ((uint32_t)0x0000FFFF) /*!< PA[15:0] Port A selection*/
#define  RI_ASMR1_PA_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_ASMR1_PA_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_ASMR1_PA_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_ASMR1_PA_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_ASMR1_PA_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_ASMR1_PA_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_ASMR1_PA_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_ASMR1_PA_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_ASMR1_PA_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_ASMR1_PA_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_ASMR1_PA_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_ASMR1_PA_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_ASMR1_PA_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_ASMR1_PA_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_ASMR1_PA_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_ASMR1_PA_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CMR1 register  ********************/
#define  RI_CMR1_PA                    ((uint32_t)0x0000FFFF) /*!< PA[15:0] Port A selection*/
#define  RI_CMR1_PA_0                  ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CMR1_PA_1                  ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CMR1_PA_2                  ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CMR1_PA_3                  ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CMR1_PA_4                  ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CMR1_PA_5                  ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CMR1_PA_6                  ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CMR1_PA_7                  ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CMR1_PA_8                  ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CMR1_PA_9                  ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CMR1_PA_10                 ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CMR1_PA_11                 ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CMR1_PA_12                 ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CMR1_PA_13                 ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CMR1_PA_14                 ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CMR1_PA_15                 ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CICR1 register  ********************/
#define  RI_CICR1_PA                   ((uint32_t)0x0000FFFF) /*!< PA[15:0] Port A selection*/
#define  RI_CICR1_PA_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CICR1_PA_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CICR1_PA_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CICR1_PA_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CICR1_PA_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CICR1_PA_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CICR1_PA_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CICR1_PA_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CICR1_PA_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CICR1_PA_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CICR1_PA_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CICR1_PA_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CICR1_PA_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CICR1_PA_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CICR1_PA_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CICR1_PA_15                ((uint32_t)0x00008000) /*!< Bit 15 */

