qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L1/TARGET_NUCLEO_L152RE/stm32l152xe.h
/********************  Bit definition for RI_ASMR2 register  ********************/
#define  RI_ASMR2_PB                   ((uint32_t)0x0000FFFF) /*!< PB[15:0] Port B selection */
#define  RI_ASMR2_PB_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_ASMR2_PB_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_ASMR2_PB_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_ASMR2_PB_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_ASMR2_PB_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_ASMR2_PB_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_ASMR2_PB_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_ASMR2_PB_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_ASMR2_PB_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_ASMR2_PB_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_ASMR2_PB_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_ASMR2_PB_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_ASMR2_PB_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_ASMR2_PB_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_ASMR2_PB_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_ASMR2_PB_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CMR2 register  ********************/
#define  RI_CMR2_PB                    ((uint32_t)0x0000FFFF) /*!< PB[15:0] Port B selection */
#define  RI_CMR2_PB_0                  ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CMR2_PB_1                  ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CMR2_PB_2                  ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CMR2_PB_3                  ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CMR2_PB_4                  ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CMR2_PB_5                  ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CMR2_PB_6                  ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CMR2_PB_7                  ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CMR2_PB_8                  ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CMR2_PB_9                  ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CMR2_PB_10                 ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CMR2_PB_11                 ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CMR2_PB_12                 ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CMR2_PB_13                 ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CMR2_PB_14                 ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CMR2_PB_15                 ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CICR2 register  ********************/
#define  RI_CICR2_PB                   ((uint32_t)0x0000FFFF) /*!< PB[15:0] Port B selection */
#define  RI_CICR2_PB_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CICR2_PB_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CICR2_PB_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CICR2_PB_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CICR2_PB_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CICR2_PB_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CICR2_PB_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CICR2_PB_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CICR2_PB_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CICR2_PB_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CICR2_PB_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CICR2_PB_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CICR2_PB_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CICR2_PB_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CICR2_PB_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CICR2_PB_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_ASMR3 register  ********************/
#define  RI_ASMR3_PC                   ((uint32_t)0x0000FFFF) /*!< PC[15:0] Port C selection */
#define  RI_ASMR3_PC_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_ASMR3_PC_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_ASMR3_PC_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_ASMR3_PC_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_ASMR3_PC_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_ASMR3_PC_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_ASMR3_PC_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_ASMR3_PC_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_ASMR3_PC_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_ASMR3_PC_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_ASMR3_PC_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_ASMR3_PC_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_ASMR3_PC_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_ASMR3_PC_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_ASMR3_PC_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_ASMR3_PC_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CMR3 register  ********************/
#define  RI_CMR3_PC                    ((uint32_t)0x0000FFFF) /*!< PC[15:0] Port C selection */
#define  RI_CMR3_PC_0                  ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CMR3_PC_1                  ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CMR3_PC_2                  ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CMR3_PC_3                  ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CMR3_PC_4                  ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CMR3_PC_5                  ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CMR3_PC_6                  ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CMR3_PC_7                  ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CMR3_PC_8                  ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CMR3_PC_9                  ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CMR3_PC_10                 ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CMR3_PC_11                 ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CMR3_PC_12                 ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CMR3_PC_13                 ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CMR3_PC_14                 ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CMR3_PC_15                 ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CICR3 register  ********************/
#define  RI_CICR3_PC                   ((uint32_t)0x0000FFFF) /*!< PC[15:0] Port C selection */
#define  RI_CICR3_PC_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CICR3_PC_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CICR3_PC_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CICR3_PC_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CICR3_PC_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CICR3_PC_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CICR3_PC_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CICR3_PC_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CICR3_PC_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CICR3_PC_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CICR3_PC_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CICR3_PC_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CICR3_PC_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CICR3_PC_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CICR3_PC_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CICR3_PC_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_ASMR4 register  ********************/
#define  RI_ASMR4_PF                   ((uint32_t)0x0000FFFF) /*!< PF[15:0] Port F selection */
#define  RI_ASMR4_PF_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_ASMR4_PF_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_ASMR4_PF_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_ASMR4_PF_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_ASMR4_PF_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_ASMR4_PF_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_ASMR4_PF_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_ASMR4_PF_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_ASMR4_PF_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_ASMR4_PF_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_ASMR4_PF_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_ASMR4_PF_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_ASMR4_PF_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_ASMR4_PF_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_ASMR4_PF_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_ASMR4_PF_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CMR4 register  ********************/
#define  RI_CMR4_PF                    ((uint32_t)0x0000FFFF) /*!< PF[15:0] Port F selection */
#define  RI_CMR4_PF_0                  ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CMR4_PF_1                  ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CMR4_PF_2                  ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CMR4_PF_3                  ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CMR4_PF_4                  ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CMR4_PF_5                  ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CMR4_PF_6                  ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CMR4_PF_7                  ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CMR4_PF_8                  ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CMR4_PF_9                  ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CMR4_PF_10                 ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CMR4_PF_11                 ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CMR4_PF_12                 ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CMR4_PF_13                 ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CMR4_PF_14                 ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CMR4_PF_15                 ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CICR4 register  ********************/
#define  RI_CICR4_PF                   ((uint32_t)0x0000FFFF) /*!< PF[15:0] Port F selection */
#define  RI_CICR4_PF_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CICR4_PF_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CICR4_PF_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CICR4_PF_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CICR4_PF_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CICR4_PF_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CICR4_PF_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CICR4_PF_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CICR4_PF_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CICR4_PF_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CICR4_PF_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CICR4_PF_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CICR4_PF_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CICR4_PF_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CICR4_PF_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CICR4_PF_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_ASMR5 register  ********************/
#define  RI_ASMR5_PG                   ((uint32_t)0x0000FFFF) /*!< PG[15:0] Port G selection */
#define  RI_ASMR5_PG_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_ASMR5_PG_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_ASMR5_PG_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_ASMR5_PG_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_ASMR5_PG_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_ASMR5_PG_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_ASMR5_PG_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_ASMR5_PG_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_ASMR5_PG_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_ASMR5_PG_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_ASMR5_PG_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_ASMR5_PG_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_ASMR5_PG_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_ASMR5_PG_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_ASMR5_PG_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_ASMR5_PG_15                ((uint32_t)0x00008000) /*!< Bit 15 */

