qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L1/TARGET_NUCLEO_L152RE/stm32l152xe.h
/********************  Bit definition for RI_CMR5 register  ********************/
#define  RI_CMR5_PG                    ((uint32_t)0x0000FFFF) /*!< PG[15:0] Port G selection */
#define  RI_CMR5_PG_0                  ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CMR5_PG_1                  ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CMR5_PG_2                  ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CMR5_PG_3                  ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CMR5_PG_4                  ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CMR5_PG_5                  ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CMR5_PG_6                  ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CMR5_PG_7                  ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CMR5_PG_8                  ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CMR5_PG_9                  ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CMR5_PG_10                 ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CMR5_PG_11                 ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CMR5_PG_12                 ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CMR5_PG_13                 ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CMR5_PG_14                 ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CMR5_PG_15                 ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CICR5 register  ********************/
#define  RI_CICR5_PG                   ((uint32_t)0x0000FFFF) /*!< PG[15:0] Port G selection */
#define  RI_CICR5_PG_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CICR5_PG_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CICR5_PG_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CICR5_PG_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CICR5_PG_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CICR5_PG_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CICR5_PG_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CICR5_PG_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CICR5_PG_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CICR5_PG_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CICR5_PG_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CICR5_PG_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CICR5_PG_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CICR5_PG_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CICR5_PG_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CICR5_PG_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/******************************************************************************/
/*                                                                            */
/*                               Timers (TIM)                                 */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for TIM_CR1 register  ********************/
#define  TIM_CR1_CEN                         ((uint32_t)0x00000001)            /*!<Counter enable */
#define  TIM_CR1_UDIS                        ((uint32_t)0x00000002)            /*!<Update disable */
#define  TIM_CR1_URS                         ((uint32_t)0x00000004)            /*!<Update request source */
#define  TIM_CR1_OPM                         ((uint32_t)0x00000008)            /*!<One pulse mode */
#define  TIM_CR1_DIR                         ((uint32_t)0x00000010)            /*!<Direction */

#define  TIM_CR1_CMS                         ((uint32_t)0x00000060)            /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       ((uint32_t)0x00000020)            /*!<Bit 0 */
#define  TIM_CR1_CMS_1                       ((uint32_t)0x00000040)            /*!<Bit 1 */

#define  TIM_CR1_ARPE                        ((uint32_t)0x00000080)            /*!<Auto-reload preload enable */

#define  TIM_CR1_CKD                         ((uint32_t)0x00000300)            /*!<CKD[1:0] bits (clock division) */
#define  TIM_CR1_CKD_0                       ((uint32_t)0x00000100)            /*!<Bit 0 */
#define  TIM_CR1_CKD_1                       ((uint32_t)0x00000200)            /*!<Bit 1 */

/*******************  Bit definition for TIM_CR2 register  ********************/
#define  TIM_CR2_CCDS                        ((uint32_t)0x00000008)            /*!<Capture/Compare DMA Selection */

#define  TIM_CR2_MMS                         ((uint32_t)0x00000070)            /*!<MMS[2:0] bits (Master Mode Selection) */
#define  TIM_CR2_MMS_0                       ((uint32_t)0x00000010)            /*!<Bit 0 */
#define  TIM_CR2_MMS_1                       ((uint32_t)0x00000020)            /*!<Bit 1 */
#define  TIM_CR2_MMS_2                       ((uint32_t)0x00000040)            /*!<Bit 2 */

#define  TIM_CR2_TI1S                        ((uint32_t)0x00000080)            /*!<TI1 Selection */

/*******************  Bit definition for TIM_SMCR register  *******************/
#define  TIM_SMCR_SMS                        ((uint32_t)0x00000007)            /*!<SMS[2:0] bits (Slave mode selection) */
#define  TIM_SMCR_SMS_0                      ((uint32_t)0x00000001)            /*!<Bit 0 */
#define  TIM_SMCR_SMS_1                      ((uint32_t)0x00000002)            /*!<Bit 1 */
#define  TIM_SMCR_SMS_2                      ((uint32_t)0x00000004)            /*!<Bit 2 */

#define  TIM_SMCR_OCCS                       ((uint32_t)0x00000008)            /*!< OCREF clear selection */

#define  TIM_SMCR_TS                         ((uint32_t)0x00000070)            /*!<TS[2:0] bits (Trigger selection) */
#define  TIM_SMCR_TS_0                       ((uint32_t)0x00000010)            /*!<Bit 0 */
#define  TIM_SMCR_TS_1                       ((uint32_t)0x00000020)            /*!<Bit 1 */
#define  TIM_SMCR_TS_2                       ((uint32_t)0x00000040)            /*!<Bit 2 */

#define  TIM_SMCR_MSM                        ((uint32_t)0x00000080)            /*!<Master/slave mode */

#define  TIM_SMCR_ETF                        ((uint32_t)0x00000F00)            /*!<ETF[3:0] bits (External trigger filter) */
#define  TIM_SMCR_ETF_0                      ((uint32_t)0x00000100)            /*!<Bit 0 */
#define  TIM_SMCR_ETF_1                      ((uint32_t)0x00000200)            /*!<Bit 1 */
#define  TIM_SMCR_ETF_2                      ((uint32_t)0x00000400)            /*!<Bit 2 */
#define  TIM_SMCR_ETF_3                      ((uint32_t)0x00000800)            /*!<Bit 3 */

#define  TIM_SMCR_ETPS                       ((uint32_t)0x00003000)            /*!<ETPS[1:0] bits (External trigger prescaler) */
#define  TIM_SMCR_ETPS_0                     ((uint32_t)0x00001000)            /*!<Bit 0 */
#define  TIM_SMCR_ETPS_1                     ((uint32_t)0x00002000)            /*!<Bit 1 */

